## Запланированное тестирование

1. Нажатие на кнопку вход в аккаунт (вход в аккаунт не выполнен)
2. Нажатие на кнопку регистрация (вход в аккаунт не выполнен)
3. Нажатие на колоду карточек(вход в аккаунт выполнен)
4. Нажатие на кнопку добавить карточку (вход в аккаунт  выполнен)
5. Нажатие на кнопку удалить колоду (вход в аккаунт выполнен)
6. Нажатие на кнопку редактировать колоду (вход в аккаунт выполнен)
7. Переход на страницу тестирования ход в аккаунт выполнен)
8. Нажатие на кнопку наччать тест flash_cards (вход в аккаунт выполнен)
9. Отображение результатов после теста flash_cards (вход в аккаунт выполнен)
10. Нажатие на кнопку для перехода на страницу результатов тестирования)
11. Нажатие на кнопку выход из аккаунта (вход в аккаунт выполнен)
12. Нажатие на кнопку для пеерехода на страницу пользователя
13. Нажатие на кнопку для смены пароля пользователя

## Тестирование приложения "EventsMap"

### Проверка запланированных входных воздействий

| Входное воздействие | Ожидаемый результат | Полученный результат |
|:---|:---|:---|
| Нажатие на кнопку вход в аккаунт (вход в аккаунт не выполнен) | При вводе данных вход в аккаунт будет выполнен | Вход в аккаунт был выполнен |
| Нажатие на кнопку регистрация (вход в аккаунт не выполнен) | При вводе данных новый аккаунт будет зарегистрирован и будет выполнен вход | Новый аккаунт был зарегистрирован и был выполнен вход |
| Нажатие на колоду карточек(вход в аккаунт выполнен) | на экране будет отображён список карточек колоды и возможные действия над колодой | Список с информацией о колоде был отображён |
| Нажатие на кнопку добавить карточку (вход в аккаунт  выполнен) | переход на станицу добавления карточки | полсе заполнения необходимых данных карточка добавлена |
| Нажатие на кнопку удалить колоду (вход в аккаунт выполнен) | удаление колоды из списка колод пользователя и переход на домашнюю страницу | удаление кооды и переход на домашнюю страницу осуществлён |
| Нажатие на кнопку редактировать колоду (вход в аккаунт выполнен) | переход на страницу редактирования колоды и сохранение изменённых данных | редактирование колоды, переход на страницу для редактирования |
| Переход на страницу тестирования ход в аккаунт выполнен) | Откроется странца со списком колод доступных для теста | Открылась страница выбора колоды для тестирования |
| Нажатие на кнопку наччать тест flash_cards (вход в аккаунт выполнен) | Начало тестирование и осуществление логики теста | Начало и успешное прохождение и завершение тестирования |
| Отображение результатов после теста flash_cards (вход в аккаунт выполнен) | Открылась страница с результатами | Страница с результатами открылась |
| Нажатие на кнопку для перехода на страницу результатов тестирования) | Переход на страницу тестирования и отображение результатов | Переход на страницу выполнен, результаты теста отображены |
| Нажатие на кнопку выход из аккаунта (вход в аккаунт выполнен) | Выход из аккаунта будет выполнен| Выход из аккаунта был выполнен |
| Нажатие на кнопку для пеерехода на страницу пользователя | Переход на страницу пользователя | Переход на страницу пользователя осуществлён |
| Нажатие на кнопку для смены пароля пользователя | Переход на страницу для редактирования пароля и сохранения изменения | Редактирование пароля выполнено, переход на страницу для редактирования  выполнен |
